[
  {
    "path": "posts/2021-11-23-detecting-trends-in-renewable-energy-investment/",
    "title": "Regional Trends in Renewable Energy Investment",
    "description": "Here I explore the trend in annualized renewable and non-renewable energy investments by different regions around the world. I also test the statistical significance of the findings.",
    "author": [
      {
        "name": "Joe DeCesaro",
        "url": {}
      }
    ],
    "date": "2021-12-01",
    "categories": [
      "Statistics",
      "R",
      "Renewable Energy"
    ],
    "contents": "\n\nContents\nWhat\nis the global trend of regional renewable energy investment over\ntime?\nData\nAnalysis Plan\nResults\nSimple Renewable\nInvestment Trend Model\nSimple\nNon-renewable Investment Trend Model\nRegional\nRenewable Investment Trend Model\n\nNext Steps\nReferences\n\n\n\n\nShow code\n\nlibrary(tidyverse)\nlibrary(here)\nlibrary(readxl)\nlibrary(janitor)\nlibrary(broom)\nlibrary(sjPlot)\nlibrary(paletteer)\nlibrary(kableExtra)\n\n\n\nWhat\nis the global trend of regional renewable energy investment over\ntime?\nImplementation of renewable energy into electric grids around the\nworld will be key to curbing the effects of climate change. Currently,\nthree quarters of global greenhouse gas emissions result from fossil\nfuel energy production (Ritchie, Roser, 2020). As put by the\nInternational Renewable Energy Agency (IRENA), “meeting international\nclimate and development objectives will require a massive re-allocation\nof capital toward low-carbon technologies, including renewables, and the\nmobilization of all available capital sources”. In the past, renewable\nenergy technologies such as solar and wind have been expensive forms of\ngenerating electricity but, over the last ten years there has been a\nsteep decline in their costs. From 2009 to 2019 the price of electricity\nfrom solar power has dropped 89% and the wind has dropped 70% (Roser,\n2020). It might seem obvious that renewable portfolios have been growing\nin recent years as governments and politicians advertise, however does\ndata actually support this? How are investments in renewable\ntechnologies changing over time? How does this compare to investment in\nnon-renewable energy?\nAs climate change becomes an ever more present and increasing threat,\ndetecting these trends can tell us if the world is on the right track to\nreducing carbon emissions from energy generation. IRENA dives deep into\nthese questions in its report, “Global Landscape of Renewable Energy\nFinance 2020” for the time period of 2013-2018. The IRENA report\ncompares investment to climate goals like the Paris Agreement and makes\nrecommendations on how these goals can be met more effectively. It also\ndiscusses the sources of the capital for energy projects and dives into\noff-grid renewable finance. The data used for the analysis in this blog\npost is from IRENA and the Climate Policy Initiative (CPI) and covers\nthe time period of 2000-2020.\nThis blog post will take a more streamlined look at the general\ninvestment trend of global regions across time with linear regression\nmodels. Using a significance level of 0.05, I aim to detect whether the\nresults from the models are statistically significant. This post is by\nno means a comprehensive study, however it will provide some quick\ninsights. Some of the limitations of this analysis are discussed in the\n“Next Steps” section below.\nData\nIRENA provides the data used in its 2020 finance report available for\ndownload from its website in an excel file format. To accompany the\ndata, IRENA also posts a “methodology” document that discusses its\nsources and how its analysis was conducted. According to the methodology\nreport, the data used in this blog post can be, “freely, used, shared,\ncopied, reproduced, printed and/or stored.” It should be noted that all\nthe data from my analysis in this post is from IRENA and they hold the\ncopyright for it.\nFinancial data can be challenging to acquire and can cause some\nmisclassifications of recipients however, IRENA has standardized this\nprocess to the greatest extent possible for these data. Private\ninvestment information can be particularly challenging to find and these\ndate are primarily taken from the Bloomberg New Energy Finance database\nby IRENA. While, the data used in this analysis may not be comprehensive\nfor all financial investment data, it is likely some of the most\ncomprehensive that is freely available. The reported investment data are\nconservative according to the methodologies provided by IRENA to prevent\n“double-counts” as they state “under-reporting of renewable investments\nis preferred to over-reporting.” The methodology report also provides\ndetailed information about data sources, regional breakdowns, and more.\nThe IRENA 2020 report and its methodologies are fully referenced\nbelow.\nThe raw data from IRENA are broken down by individual project\ninvestments in renewable and non-renewable energy sources with the\namount of the investment in million USD. For each individual investment\nthere is a plethora of data available including the year, country,\nregion, donor, technology, and more. The time frame of data available\nfrom this data is from 2000-2020 This blog post will use annualized\ntotals of investment for global regions and therefore does not have a\nseasonal component. The countries represented in regional breakdowns\nwere not determined by the author of this post and is directly embedded\nfrom these IRENA data.\n\n\nShow code\n\n# Make file path for the data\nfp <- here(\"_posts/2021-11-23-detecting-trends-in-renewable-energy-investment/data/IRENA_RE_Public_Investment_July2021.xlsx\")\n\n# Read in the data using the readxl package\nfin_energy <- read_excel(fp)\n\n\n\n\n\nShow code\n\n# Clean the data to remove fields that are not needed\nfin_energy <- fin_energy %>% \n  clean_names() \n\n# Remove unnecessary columns and the \"multilateral\" region \nfin_energy <- fin_energy %>% \n  select(iso_code:region, year:technology, amount_2019_usd_million) %>% \n  filter(region != \"Multilateral\")\n\n\n\n\n\nShow code\n\n# Separate the data into the renewable and non-renewable investments\n# The category section is kept to rejoin the data later to differentiate easily in a graph\nrenewable_fin <- fin_energy %>% \n  filter(category == \"Renewables\") %>% \n  group_by(country_area, region, category, year) %>% \n  summarise(country_sum = sum(amount_2019_usd_million))\n\nnon_renewable_fin <- fin_energy %>% \n  filter(category ==\"Non-renewables\") %>% \n  group_by(country_area, region, category, year) %>% \n  summarise(country_sum = sum(amount_2019_usd_million))\n\n\n\n\n\nShow code\n\n# Make data frame for renewables for by region\nregion_renewable_fin <- renewable_fin %>% \n  group_by(region, category, year) %>% \n  summarise(region_sum = sum(country_sum))\n\n# Make data frame for non-renewables for by region\nregion_non_renewable_fin <- non_renewable_fin %>% \n  group_by(region, category, year) %>% \n  summarise(region_sum = sum(country_sum))\n\n# Make a data frame of the regional summations for graphing purposes later\nfull_region_fin <- full_join(x = region_renewable_fin, \n                             y = region_non_renewable_fin)\n\n\n\nAnalysis Plan\nFirst, a simple static time series model will explore the trend of\nthe total annual amount invested in renewable energy by region across\ntime. Regions are broken into Africa, Asia, Central America and the\nCaribbean, Eurasia, Europe, Middle East, Oceania, and South America. By\nrunning this simple model I aim to get a quick glimpse into the global\ntrend of renewable investment over time, if one exists. This assumes\nthat only the immediate year in question has an effect on the quantity\nof investment. This will then be compared to the trend in non-renewable\nenergy source investment over the same time period. As previously\nmentioned, a significance level of 0.05 will be used to determine\nstatistical significance. The null hypothesis for this first regression\nis that there is no relationship of annual renewable energy investment\nby regions over time.\nSecond, a more complex time series regression model will be produced\nwhere the primary simple regression model is broken up by regional\nheterogeneity to produce an interaction regression model. The first\ntrend regression model provides a quick insight into how the world is\ninvesting as a whole based on regional sums for each year. However, it\nis evident with accords like The Paris Agreement it will take each\ncountry’s and region’s participation to minimize and eventually reverse\nthe effects of climate change. With this in mind, the first regression\nmodel hides that certain regions are committing greater investments over\ntime than other regions.\nIf regions are truly committed to curbing climate change the second\nregression model will show an overall positive trend. This evaluation\nwill serve as a litmus test to observe regional commitment to global\nclimate agreements. The same significance level will be used to test the\nnull hypothesis that, within each region, there is no change of\nrenewable investment rate over time. Finally, regional renewable trends\nwill then be compared to their non-renewable counterparts.\nResults\nSimple Renewable\nInvestment Trend Model\nBelow is the result of the regression model that tests the effect of\nyear on renewable investment. The output below is from the\nsummary() function, which quickly provides summary\nstatistics in R.\n\n\nShow code\n\n# Lets make our simple model for renewable energy\nmodel_renew <- lm(region_sum ~ year, data = region_renewable_fin)\n\nsummary_model_renew <- summary(model_renew)\nsummary_model_renew\n\n\n\nCall:\nlm(formula = region_sum ~ year, data = region_renewable_fin)\n\nResiduals:\n    Min      1Q  Median      3Q     Max \n-2905.6 -1271.5  -523.4   486.5 11707.5 \n\nCoefficients:\n              Estimate Std. Error t value Pr(>|t|)    \n(Intercept) -283692.95   53418.15  -5.311 3.13e-07 ***\nyear            141.88      26.58   5.339 2.73e-07 ***\n---\nSignif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\n\nResidual standard error: 2167 on 184 degrees of freedom\nMultiple R-squared:  0.1341,    Adjusted R-squared:  0.1294 \nF-statistic:  28.5 on 1 and 184 DF,  p-value: 2.735e-07\n\nUsing the summary() function, we can quickly get some\ninsights from the regression model. From the output above the\ncoefficient estimate of the year tells us the annual rate of change of\ninvestment with each increasing year for global regions. From the\nregression model, this is 141.88 million USD. This tells us that,\naccording to this model, with each passing year we are seeing a increase\nin renewable investment by 142,000,000 USD across each region per year.\nOverall this is a positive trend for renewable investments year over\nyear.\nFrom the summary() function the p-value is represented\nin the “Coefficients” section of the table under “Pr(>|t|)”. The year\ncoefficient has a p-value below 0.001 which allows rejection of a null\nhypothesis that there is no relationship between annual renewable\ninvestment sums across time with a significance level of 0.05. It should\nbe noted that our R-squared value for this model is 0.13 however that is\nnot vital for this analysis as it is not focused on predicting outcomes\nof investment with high precision, but rather the overall trend from the\nyear coefficient and its’ associated p-value.\nWith the information above, I believe the originally proposed\nquestion is answered and these data support that there is a positive\nrate of investment in renewable projects over time. Now lets compare\nthat to non-renewables.\nSimple\nNon-renewable Investment Trend Model\n\n\nShow code\n\n# Lets make a model for non-renewables\nmodel_non_renew <- lm(region_sum ~ year, data = region_non_renewable_fin)\n\nsummary_model_non_renew <- summary(model_non_renew)\nsummary_model_non_renew\n\n\n\nCall:\nlm(formula = region_sum ~ year, data = region_non_renewable_fin)\n\nResiduals:\n    Min      1Q  Median      3Q     Max \n-2660.1 -1457.2  -796.8   -24.5 18677.7 \n\nCoefficients:\n              Estimate Std. Error t value Pr(>|t|)   \n(Intercept) -218612.31   77728.01  -2.813  0.00549 **\nyear            109.54      38.67   2.833  0.00518 **\n---\nSignif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\n\nResidual standard error: 2974 on 170 degrees of freedom\nMultiple R-squared:  0.04507,   Adjusted R-squared:  0.03945 \nF-statistic: 8.023 on 1 and 170 DF,  p-value: 0.005176\n\nFrom the summary() of this model, there is also a\npositive trend of non-renewable investment across regions. There is an\nannual increase in non-renewable investments by 109.54 million USD. With\na p-value of 0.005 a null hypothesis can be rejected that there is no\nrelationship between annual non-renewable investment over time with a\nsignificance level of 0.05.\nAccording to these two simple models, there is a larger increase in\nrenewable investments year over year in this 20-year time period\ncompared to non-renewables but as the standard errors for the models\noverlap this observation is not conclusive and this blog post will not\nbe pursuing this question. Below is a plot that compares renewable and\nnon-renewable investments over time, along with their respective\nmodels.\n\n\nShow code\n\nsimple_model_plot <- ggplot(data = full_region_fin, \n                            aes(x = year, \n                                y = region_sum,\n                                color = category)) + \n  geom_point(alpha = 0.8) +\n  scale_color_manual(name = \"Energy Type\", \n                     values = c(\"tan3\", \"darkgreen\")) +\n  geom_line(data = augment(model_renew),\n             aes( y = .fitted),\n             color = \"darkgreen\") +\n  geom_line(data = augment(model_non_renew),\n             aes( y = .fitted),\n             color = \"tan3\") +\n  labs(caption = \"Renewable investments from 2000-2020 are increasing at a rate of 141 million USD per year according\\nto this model. Non-renewable invesments over the same time period are increasing at a rate of\\n110 million USD per year.\",\n       title = \"Comparing Investment Renewable and Non-renewable Energy\\nInvestment Across Regional Sums\") +\n  xlab(label = \"Year\") +\n  ylab(label = \"Annual Regional Sum of Investment (million USD)\") +\n  theme_bw() +\n  theme(plot.caption = element_text(hjust = 0))\n  \nsimple_model_plot\n\n\n\n\nIt can be observed from the graph that there has been significant\ninvestment in renewable (green) and non-renewable (tan) energy projects\nsince the 2008 global recession. The plot illustrates just how much\nvariance there is in investment totals across regions in each year. As\ndiscussed above, the plot shows that there is a larger investment rate\nin renewables year-over-year. As this data is only from the years\n2000-2020 these investment trends do not reflect the historical\ninvestments in non-renewable energy sources. As this simple regression\nonly looks at the trend over time I will now investigate how these\ninvestment trends compare across separate regions.\nRegional Renewable\nInvestment Trend Model\nFor the regional renewable investment interaction regression model,\nthe same summary() function is used to calculate\ncoefficients and summary statistics. While the summary()\nfunction is useful, its’ output can be quite messy with interaction\nmodels; the table below is from the summary() results and\nincludes the annual investment rates for different regions and their\ncorresponding p-values. In the regression model, the North America\nregion was set as the base level of the regression. This was done\nbecause North America contains the United States, the country with the\nlargest GDP in the world and therefore a significant marker to compare\nagainst other regions.\n\n\nShow code\n\n# Make levels for regions with North America as first to compare our region to the rest of the world\nregion_renewable_fin$region <- factor(region_renewable_fin$region, levels = c(\"North America\", \"Africa\", \"Asia\", \"Central America and the Caribbean\", \"Eurasia\", \"Europe\", \"Middle East\", \"Oceania\", \"South America\"))\n\n# Make the regional investment model\nregion_model <-  lm(region_sum ~ year + region + region:year, data = region_renewable_fin)\nregion_renew_model_summary <- summary(region_model)\n\n\n\n\n\nShow code\n\n# Making the results a summary table\nsummary_renew_region_table <- data.frame(Region = c(\"North America\", \n                                                      \"Africa\", \n                                                      \"Asia\", \n                                                      \"Central America and the Caribbean\", \n                                                      \"Eurasia\", \n                                                      \"Europe\", \n                                                      \"Middle East\", \n                                                      \"Oceania\", \n                                                      \"South America\"), \n                                         Renewable_Investment = c(region_renew_model_summary$coefficients[2,\"Estimate\"], \n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[11,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[12,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[13,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[14,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[15,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[16,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[17,\"Estimate\"],\n                                                                  region_renew_model_summary$coefficients[2,\"Estimate\"] + region_renew_model_summary$coefficients[18,\"Estimate\"]),\n                                         p_value = c(region_renew_model_summary$coefficients[2,\"Pr(>|t|)\"], \n                                                                                         region_renew_model_summary$coefficients[11,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[12,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[13,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[14,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[15,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[16,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[17,\"Pr(>|t|)\"],\n                                                                                         region_renew_model_summary$coefficients[18,\"Pr(>|t|)\"])\n) %>% \n  mutate(Renewable_Investment = round(Renewable_Investment, 2))\n\nsummary_renew_region_table %>% \n  kable(col.names = c(\"Region\", \"Renewable Investment per Year (million USD)\", \"p-value\")) %>% \n  kable_styling(bootstrap_options = \"striped\", \n                full_width = FALSE, \n                latex_options = \"HOLD_position\")\n\n\n\nRegion\n\n\nRenewable Investment per Year (million USD)\n\n\np-value\n\n\nNorth America\n\n\n24.76\n\n\n0.6615318\n\n\nAfrica\n\n\n288.09\n\n\n0.0011902\n\n\nAsia\n\n\n234.07\n\n\n0.0095686\n\n\nCentral America and the Caribbean\n\n\n54.20\n\n\n0.7128610\n\n\nEurasia\n\n\n54.84\n\n\n0.7173467\n\n\nEurope\n\n\n315.08\n\n\n0.0003684\n\n\nMiddle East\n\n\n22.61\n\n\n0.9785519\n\n\nOceania\n\n\n7.27\n\n\n0.8400681\n\n\nSouth America\n\n\n255.03\n\n\n0.0044462\n\n\nThe annual investment rate of each region according to this linear\nregression interaction model is available in the table. The regions with\nthe two highest annual investment rates over time are Europe and Africa.\nEurope has widely been seen as a leader in renewable energy development\nand this is confirmed by the regression model. From IRENA’s raw data,\nAfrica’s renewable energy investment has been particularly high in\nhydropower throughout various countries. The regions with the two lowest\ninvestment rates over time are Oceania and the Middle East. Oceania is\nprimarily made up of island nations with low populations so large\ninvestments in these technologies can be challenging. The Middle East\nproduces large quantities of the world’s fossil fuels so its lack of\ninvestment is not surprising.\nThe only regions with p-values below a significance level of 0.05 are\nAfrica, Asia, Europe, and South America. Therefore, for these regions we\ncan reject the null hypothesis that there is no relationship for the\nregion’s annual investment in renewables over time. Below is a plot that\nshows the regional model and the renewable investment rates over time\nseparated by region.\n\n\nShow code\n\n# Plotting the regional model\nregional_model_plot <- ggplot(data = region_renewable_fin, \n                            aes(x = year, y = region_sum, color = region)) + \n  geom_point() + \n  geom_line(data = augment(region_model), \n             aes(y = .fitted)) + \n  scale_color_paletteer_d(\"colorBlindness::paletteMartin\") +\n  labs(caption = \"Renewable investments from 2000-2020 are increasing over time at greater rates for Europe, Africa,\\nSouth America, and Asia at a much greater rate than compared to the other regions. There are two\\ndistinct groups of renewable investment rates across time, a high investment group and a low\\ninvestment group\",\n       title = \"Determining the Annual Rate of Renewable Investment Over Time by\\nEach Region\") +\n  xlab(label = \"Year\") +\n  ylab(label = \"Annual Regional Sum of Investment (million USD)\") +\n  theme_bw() + \n  theme(plot.caption = element_text(hjust = 0)) + \n  guides(color = guide_legend(title = \"Region\"))\n\nregional_model_plot\n\n\n\n\nThe graphic clearly defines two different annual investment rate\ncategories for global regions, a high investment rate group and a low\ninvestment rate group. The high rate investment group contains Europe,\nAfrica,South America, and Asia. The low rate of investment group\ncontains North America, Central America and the Caribbean, Eurasia, the\nMiddle East, and Oceania.\nBased on the regional interaction regression model above, I do the\nsame for non-renewable energy investment and summarize both models into\none output table.\n\n\nShow code\n\n# Make levels for regions with North America as first to compare our region to the rest of the world\nregion_non_renewable_fin$region <- factor(region_non_renewable_fin$region, levels = c(\"North America\", \"Africa\", \"Asia\", \"Central America and the Caribbean\", \"Eurasia\", \"Europe\", \"Middle East\", \"Oceania\", \"South America\"))\n\n# Make the regional investment model\nregion_non_renew_model <-  lm(region_sum ~ year + region + region:year, data = region_non_renewable_fin)\nregion_non_renew_model_summary <- summary(region_non_renew_model)\n\n\n\n\n\nShow code\n\nsummary_investment_region_table <-  data.frame(summary_renew_region_table, \n                                               Non_Renewable_Investment = c(region_non_renew_model_summary$coefficients[2,\"Estimate\"], \n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[11,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[12,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[13,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[14,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[15,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[16,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[17,\"Estimate\"],\n                                                                  region_non_renew_model_summary$coefficients[2,\"Estimate\"] + region_non_renew_model_summary$coefficients[18,\"Estimate\"]), \n                                               Non_Renewable_p_value = c(region_non_renew_model_summary$coefficients[2,\"Pr(>|t|)\"], \n                                                                         region_non_renew_model_summary$coefficients[11,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[12,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[13,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[14,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[15,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[16,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[17,\"Pr(>|t|)\"],\n                                                                         region_non_renew_model_summary$coefficients[18,\"Pr(>|t|)\"])) %>% \n  mutate(Non_Renewable_Investment = round(Non_Renewable_Investment, 2))\n\n\n\n\n\nShow code\n\nsummary_investment_region_table %>% \n  kable(col.names = c(\"Region\", \n                      \"Renewable Investment per Year (million USD)\", \n                      \"Renewable p-value\",\n                      \"Non-renewable Investment per Year (million USD)\",\n                      \"Non-renewable p-value\")) %>% \n  kable_styling(bootstrap_options = \"striped\", \n                full_width = FALSE, \n                latex_options = \"HOLD_position\") %>% \n  column_spec(column = 1, width = \"1in\") %>% \n  column_spec(column = 2, width = \"1.3in\") %>% \n  column_spec(column = 3, width = \"1in\") %>% \n  column_spec(column = 4, width = \"1.3in\") %>% \n  column_spec(column = 5, width = \"1in\") \n\n\n\nRegion\n\n\nRenewable Investment per Year (million USD)\n\n\nRenewable p-value\n\n\nNon-renewable Investment per Year (million USD)\n\n\nNon-renewable p-value\n\n\nNorth America\n\n\n24.76\n\n\n0.6615318\n\n\n9.97\n\n\n0.9456139\n\n\nAfrica\n\n\n288.09\n\n\n0.0011902\n\n\n155.40\n\n\n0.4086434\n\n\nAsia\n\n\n234.07\n\n\n0.0095686\n\n\n254.85\n\n\n0.1649952\n\n\nCentral America and the Caribbean\n\n\n54.20\n\n\n0.7128610\n\n\n6.05\n\n\n0.9829376\n\n\nEurasia\n\n\n54.84\n\n\n0.7173467\n\n\n96.44\n\n\n0.6229642\n\n\nEurope\n\n\n315.08\n\n\n0.0003684\n\n\n81.26\n\n\n0.6852117\n\n\nMiddle East\n\n\n22.61\n\n\n0.9785519\n\n\n35.86\n\n\n0.8897374\n\n\nOceania\n\n\n7.27\n\n\n0.8400681\n\n\n-0.56\n\n\n0.9573164\n\n\nSouth America\n\n\n255.03\n\n\n0.0044462\n\n\n171.52\n\n\n0.3588261\n\n\nThe above table allows for the comparison of the annual rates of\nrenewable and non-renewable investment over time by each region and\ntheir corresponding p-values. The non-renewable regression model has no\ninvestment rate p-value below a significance level of 0.05. Therefore no\nnon-renewable investment rate can be considered statistically\nsignificant. For renewables, the investment rates for Africa, Asia,\nEurope, and South America can be considered statistically significant as\ntheir p-values are below a significance level of 0.05.\nSome interesting regional insights from this table however show that\nSouth America, Africa, and Asia are investing heavily in renewable and\nnon-renewable energies over time. These regions have economies that are\ndeveloping rapidly compared to other regions of the world and it is\nevident in these investment trends. According to the regression models,\nEurope has been investing the most in renewables compared to other\nregions year-over-year but not in non-renewables. However, as mentioned\nearlier no non-renewable investment rates can be considered\nstatistically significant so it is difficult to comment on non-renewable\ntrends as they may not exist.\nTo summarize, the world as a whole is investing more in renewable\nenergy projects each year. However, the world is also investing more in\nnon-renewable energy projects each year. By region, only the annual\ninvestment rates for Africa, Asia, Europe, and South America can be\nconsidered statistically significant as their p-values are below a\nsignificance level of 0.05. For other regions, the regression model\nfails to reject the null hypothesis that there is no relationship with\ninvestment in renewable projects over time.\nNext Steps\nThis blog post and regression analysis is by no means a comprehensive\nlook at financial investments over time by each region. It provides\nquick insights into how some regions are investing in renewable\ntechnologies at a greater rate over time compared to other regions.\nThere are many factors that can affect a regions total annual investment\ninto renewable energy.\nTo dive further into the questions put forward earlier, it would be\ninteresting to normalize investment rates with the GDP of each region.\nOne could also compare specific countries and the affect of the type of\ngovernment on renewable investment energies. Regional trends can also be\ngreatly affected by a single country’s influence so breaking down this\nanalysis by country would provide further insights. Another option would\nbe to compare the investment rates of countries with rapidly developing\neconomies compared to those who have developed economies to see if there\nare any relevant trends. As noted before, there is a visual trend in the\ngraphs that much greater investment occurred after the 2008 recession. A\ndeeper analysis could be done to see if this observation is statistical\nsignificant and to try and figure out what has caused it.\nReferences\nIRENA, & CPI. (n.d.-a). Global Landscape of\nRenewable Energy Finance 2020. 88.\nIRENA, & CPI. (n.d.-b). Global Landscape of\nRenewable Energy Finance 2020: Methodology. 16.\nRitchie, H., & Roser, M. (2020). Energy. Our\nWorld in Data. https://ourworldindata.org/renewable-energy\nRoser, M. (n.d.). Why did renewables become so cheap\nso fast? Our World in Data. https://ourworldindata.org/cheap-renewables-growth\n\n\n\n",
    "preview": "posts/2021-11-23-detecting-trends-in-renewable-energy-investment/images/Regional_Regression.png",
    "last_modified": "2022-05-07T10:57:39-07:00",
    "input_file": "detecting-trends-in-renewable-energy-investment.knit.md",
    "preview_width": 3000,
    "preview_height": 2100
  },
  {
    "path": "posts/2021-08-10-a-function-i-learned/",
    "title": "The Basics of the ggplot() Function",
    "description": "A short introduction to the `ggplot()` function within the tidyverse library.",
    "author": [
      {
        "name": "Joe DeCesaro",
        "url": {}
      }
    ],
    "date": "2021-08-10",
    "categories": [
      "R",
      "tidyverse"
    ],
    "contents": "\n\n\nShow code\n\nknitr::opts_chunk$set(echo = FALSE)\nlibrary(tidyverse)\nlibrary(palmerpenguins)\n\n\n\nThe basics of the\nggplot() function:\nggplot() allows for the easy plotting of various types\nof graphic representations of data frames. These plots can start out as\nsimple but can also be highly complex and customized. Below is an\nexample of a simple point graph of data from the Palmer Penguins data\nset.\n\n\nShow code\n\nggplot(data = penguins, aes(x = flipper_length_mm, y = body_mass_g)) +\n  geom_point()\n\n\n\n\nNote that it is critical to specify the type of plot desired after\nthe ggplot() function. Below is an example of using the\ngeom_line() function where above uses the\ngeom_point() function.\n\n\nShow code\n\nggplot(data = penguins, aes( x = flipper_length_mm, y = body_mass_g)) +\n  geom_line()\n\n\n\n\nLooking at the scatter plot above (not the line plot) does not\nprovide much useful information from the data set. In data science it is\nimportant to call out specific groups within your data. In the Palmer\nPenguins data, three separate species of penguins are observed. Let’s\ntake a look at how we can separate the data by species within the\nplot.\n\n\nShow code\n\nggplot(data = penguins, aes(x = flipper_length_mm, y = body_mass_g)) +\n  geom_point(aes(color = species))\n\n\n\n\nBy seperating the data by species we can now clearly draw some\ndistinct conclusions from the data for each species. For example, we\nknow that Gentoo penguins will generally be the largest penguins.\nIt is always a good idea to take a look at your data BEFORE you begin\nworking with it. By looking at the penguins data prior to\nplotting it, I would have known that there were three species within\nthis data set and that I should probably have seperated them in the plot\nfrom the beginning.\nThis is a very brief introduction to the ggplot()\nfunction. Future posts will add to the foundations set in this\nintroduciton.\n\n\n\n",
    "preview": "posts/2021-08-10-a-function-i-learned/images/ggplot_ex.png",
    "last_modified": "2022-05-07T10:56:20-07:00",
    "input_file": "a-function-i-learned.knit.md",
    "preview_width": 1400,
    "preview_height": 865
  }
]
